{"version": "https://jsonfeed.org/version/1.1", "title": "Nokia Event Driven Automation", "home_page_url": "https://docs.eda.dev/25.12/", "feed_url": "https://docs.eda.dev/25.12/feed_json_updated.json", "description": "Nokia EDA is the platform for automating your infrastructure.", "icon": null, "authors": [{"name": "Nokia"}], "language": "en", "items": [{"id": "https://docs.eda.dev/25.12/blog/try-eda-like-a-pro/", "url": "https://docs.eda.dev/25.12/blog/try-eda-like-a-pro/", "title": "Try EDA Like a Pro", "content_html": "<h1>Try EDA Like a Pro</h1>\n<p>Our tiny but mighty <code>make try-eda</code> command carries out the entire <a href=\"../../../getting-started/try-eda.md\">EDA Playground</a> installation. It installs a Kubernetes cluster, deploys the EDA core apps, and creates the necessary playground components along with a simulated network topology.<br>\nAutomation greatness, one click away. Just like we love it.</p>\n<p>But as you build up your EDA experience, you may find yourself eager to step off the beaten path and start customizing your installation experience to your needs. In this blog post we share some new additions made to the Playground installation to make your Try EDA experience more enjoyable.</p>", "image": null, "date_modified": "2025-08-09T08:19:03+00:00", "date_published": "2024-12-11T00:00:00+00:00", "authors": [{"name": "Roman Dodin"}], "tags": ["installation"]}, {"id": "https://docs.eda.dev/25.12/blog/eda-254/", "url": "https://docs.eda.dev/25.12/blog/eda-254/", "title": "EDA 25.4", "content_html": "<h1>EDA 25.4</h1>\n<p>It is that time again :partying_face: The EDA product team are pleased to announce the release of EDA 25.4.1 :rocket:</p>\n<p>The team have been hard at work; introducing our first non-SR Linux OS, a boatload of QoL UI improvements (bulk edits!), and a number of app extensions to cover additional use cases.</p>\n<p>To some numbers! In this release we delivered <strong>152 GA features</strong>, 14 alpha features, and 90 beta features (I'll come back to this later).</p>", "image": null, "date_modified": "2025-06-10T15:11:13+00:00", "date_published": "2025-05-01T00:00:00+00:00", "authors": [{"name": "Bruce Wallis"}], "tags": ["release"]}, {"id": "https://docs.eda.dev/25.12/blog/150-minutes-of-eda/", "url": "https://docs.eda.dev/25.12/blog/150-minutes-of-eda/", "title": "150 minutes of EDA", "content_html": "<h1>150 minutes of EDA</h1>\n<p>A week ago we gathered for the 20th time with our partners and customers to share our vision for the future of networking. The sunny Tarragona hosted our <strong>SReXperts EMEA 2025</strong> and it was a blast. Many after-event social media postings[^1][^2][^3] can give you a taste of the event.</p>\n<p>It was also the first time we hosted the EDA hackathon for the lucky hundred participants who were there with us on the first day to learn about the product and later solve some challenges we carefully outlined on the https://hack.srexperts.net website.</p>\n<p>It was great to see so many people getting engaged and excited about the possibilities EDA brings to the industry and getting the most out of the practical exercises.</p>\n<p>Yet, we understand that not everyone could make it to the event, and that's why we've decided to share the theoretical part of the hackathon with the community, as we believe in the power of knowledge sharing and collaboration.</p>", "image": null, "date_modified": "2025-06-10T15:11:13+00:00", "date_published": "2025-06-10T00:00:00+00:00", "authors": [{"name": "Roman Dodin"}], "tags": []}, {"id": "https://docs.eda.dev/25.12/blog/the-beginning-of-an-era-eda/", "url": "https://docs.eda.dev/25.12/blog/the-beginning-of-an-era-eda/", "title": "The beginning of an era EDA", "content_html": "<h1>The beginning of an ~~era~~ EDA</h1>\n<div class=\"grid\" markdown>\n<div markdown>\nToday marks a huge milestone. You may have heard us talking about \"EDA\" at several public events - now you get to experience it for yourself.\n\nIt was a mere 24 months ago that we started the initial design for a next generation controller, which eventually adopted the codename EDA - Event Driven Automation.\n\nOur goals were lofty; intents without inflexibility, simplified consumption of streaming telemetry, multi vendor, multi domain, CI/CD, pipelines, all encompassing revision control, all built for the modern tooling era.\n\nDid we succeed? You get to be the judge!\n\n</div>\n\n<figure markdown>\n  ![img](../../../images/eda.svg)\n</figure>\n\n</div>", "image": null, "date_modified": "2024-12-12T15:53:17+00:00", "date_published": "2024-12-12T00:00:00+00:00", "authors": [{"name": "Bruce Wallis"}], "tags": ["media", "nfd"]}]}